artillery-tests/04-stress-test.yml
config:
  target: "http://sample-app:3000"
  phases:
    - duration: 60
      arrivalRate: 50
      name: "Baseline"
    - duration: 120
      arrivalRate: 100
      name: "Approaching limits"
    - duration: 120
      arrivalRate: 200
      name: "Beyond capacity"
    - duration: 120
      arrivalRate: 300
      name: "Extreme stress"
    - duration: 60
      arrivalRate: 50
      name: "Recovery"
  timeout: 10

scenarios:
  - flow:
      - get:
          url: "/api/products"
      - get:
          url: "/api/users"
      - post:
          url: "/api/orders"
          json:
            userId: "{{ $randomNumber(1, 1000) }}"
            productId: "{{ $randomNumber(1, 100) }}"
            quantity: 1
            paymentMethod: "credit_card"